{
  "_meta": {
    "maxChars": {
      "start_button": 20,
      "time": 10,
      "score": 10,
      "trait_acquired_title": 35,
      "trait_acquired_multi_title": 35,
      "trait_total_title": 35,
      "trait_youve_acquired": 40,	
      "trait_1": 100,
      "trait_2": 100,
      "trait_3": 100,
      "trait_4": 100,
      "trait_5": 100,
      "trait_6": 100,
      "trait_7": 100,
      "trait_8": 100,
      "trait_9": 100,
      "trait_10": 100,
      "stage1_title": 40,
      "stage1_welcome_title": 50,
      "stage1_welcome_desc": 400,
      "stage1_inherited_title": 50,
      "stage1_inherited_desc": 400,
      "stage1_story_title": 50,
      "stage1_story_desc": 400,
      "stage1_camel_shape_title": 50,
      "stage1_camel_shape_desc": 400,
      "stage1_camel_head_title": 50,
      "stage1_camel_head_desc": 400,
      "stage1_camel_body_title": 50,
      "stage1_camel_body_desc": 400,
      "stage1_camel_legs_title": 50,
      "stage1_camel_legs_desc": 400,
      "stage1_finished_title": 50,
      "stage1_finished_desc": 400,
      "stage1_daddy": 20,
      "stage1_mommy": 20,
      "stage1_baby": 20,
      "stage1_correct": 30,
      "stage1_wrong": 30,
      "stage1_timeup": 30,
      "stage1_question1": 50,
      "stage1_question2": 50,
      "stage1_question3": 50,
      "stage2_title": 40,
      "stage2_welcome_title": 50,
      "stage2_welcome_desc": 400,
      "stage2_environmental_title": 50,
      "stage2_environmental_desc": 400,
      "stage2_solve_puzzle_title": 50,
      "stage2_solve_puzzle_desc": 400,
      "stage2_finished_title": 50,
      "stage2_finished_desc": 400,
      "stage2_timeup_title": 50,
      "stage2_timeup_desc": 400,
      "stage2_timeup_finished_title": 50,
      "stage2_timeup_finished_desc": 400,
      "stage2_head_title": 50,
      "stage2_head_desc": 400,
      "stage2_drink_title": 50,
      "stage2_drink_desc": 400,
      "stage2_humps_title": 50,
      "stage2_humps_desc": 400,
      "stage2_fur_title": 50,
      "stage2_fur_desc": 400,
      "stage2_legs_title": 50,
      "stage2_legs_desc": 400,
      "stage3_title": 40,
      "stage3_welcome_title": 50,
      "stage3_welcome_desc": 400,
      "stage3_learned_title": 50,
      "stage3_learned_desc": 400,
      "stage3_train_title": 50,
      "stage3_train_desc": 400,
      "stage3_timeup_run_title": 50,
      "stage3_timeup_run_desc": 400,
      "stage3_welldone_run_title": 50,
      "stage3_welldone_run_desc": 400,
      "stage3_timeup_jump_title": 50,
      "stage3_timeup_jump_desc": 400,
      "stage3_welldone_jump_title": 50,
      "stage3_welldone_jump_desc": 400,
      "stage3_timeup_jump_desc": 400,
      "stage3_finished_title": 50,
      "stage3_finished_desc": 400
    }
  },
  "en": {
    "start_button": "Start!",
    "time": "Time:",
    "score": "Score:",
    "trait_acquired_title": "Trait Acquired",
    "trait_acquired_multi_title": "Traits Acquired",
    "trait_list_title": "Trait List",
    "trait_youve_acquired": "You have acquired:\n\n",
    "trait_1": "Camel's head shape.",
    "trait_2": "Camel's body shape.",
    "trait_3": "Camel's legs and feet shape.",
    "trait_4": "Camel's eyelashes, eyebrows, and nostrils.",
    "trait_5": "Camel's diet and drinking habits.",
    "trait_6": "Camel's humps.",
    "trait_7": "Camel's fur and metabolism.",
    "trait_8": "Camel's legs and feet.",
    "trait_9": "Run on command.",
    "trait_10": "Jump on command.",
    "stage1_title": "Inherited Traits",
    "stage1_welcome_title": "Stage 1: Inherited Traits",
    "stage1_welcome_desc": "Welcome to the \"Circus Camel: Inherited, Environmental, and Learned\" game!\n\nIn this game, you will learn about the traits of living creatures while also having fun playing this awesome game. You will learn about the differences of inherited traits, environmental traits, and learned traits.\n\nSo... Let's begin, shall we?",
    "stage1_inherited_title": "What are Inherited Traits?",
    "stage1_inherited_desc": "A trait is a characteristic of an organism. Some examples of traits are color, size, shape, texture, etc.\n\nInherited traits are the traits of a human, animal or plant that will be passed from the parents to their kids or offsprings. These traits will be unique based on the species of the organism. The inherited traits are passed on by means of genetic information in the organism's DNA.",
    "stage1_story_title": "Circus Camel",
    "stage1_story_desc": "Hooray! It's a merry, merry day for you. You've got a chance to be an animal trainer for a circus. You have been tasked by the owner to train a camel to be the star of the show.\n\nBut first, you must decide the traits of the camel based on the parents and lineage of the camel. Your job is to help identify which are the correct shapes of the baby camel's body based on its inherited traits.",
    "stage1_camel_shape_title": "Camel Inherited Traits",
    "stage1_camel_shape_desc": "A living organism will pass on its traits, including its shape, to its offsprings. So, the daddy camel and mommy camel will pass on their shape and other traits to the baby camel.\n\nNow let us choose the correct shape of the camel based on its parent's. Can you choose the correct head of the baby camel?",
    "stage1_camel_head_title": "Camel Head Shape",
    "stage1_camel_head_desc": "The shape of camel's head is unique and it has some purpose to help the camel survive in the desert. It is (and  many other traits of the camel) originated from the environmental trait that was developed when the animal is trying to adapt to its environment.\n\nWe will discuss more about the environmental traits in the next stage. Next, can you guess the correct body of the camel?",
    "stage1_camel_body_title": "Camel Body Shape",
    "stage1_camel_body_desc": "Just like the head, the body of a camel is unique and serve as a way to handle and adapt to the environment where the camel lives, namely the desert. And it is also being passed on to the next generation. So the shape of the body will also be similar (with minor differences) between each camel.\n\nLastly, can you choose the correct legs and feet of the camel?",
    "stage1_camel_legs_title": "Camel Legs and Feet Shape",
    "stage1_camel_legs_desc": "The legs and feet of a camel are also unique and serve as tools to live on the desert (or more accurately to walk and run on the desert). And like the traits before, it will be passed on to the next generations, eventually.\n\nNow, you have completely identify the shape of the baby camel which is inherited from its parent.",
    "stage1_finished_title": "Stage Finished",
    "stage1_finished_desc": "Well done. You have finished this stage. And hopefully, you have learned more about inherited traits. Next, we will learn about the environmental traits in the next stage.\n\nPlease tap the button to go to next stage!",
    "stage1_daddy": "Daddy",
    "stage1_mommy": "Mommy",
    "stage1_baby": "Baby",
    "stage1_correct": "You are correct!",
    "stage1_wrong": "You are incorrect!",
    "stage1_timeup": "Time is up!",
    "stage1_question1": "Which one is the correct head of the camel?",
    "stage1_question2": "Which one is the correct head of the camel?",
    "stage1_question3": "Which one is the correct legs of the camel?",
    "stage2_title": "Environmental Traits",
    "stage2_welcome_title": "Stage 2: Environmental Traits",
    "stage2_welcome_desc": "Hello student, nice to meet you again. Well done on reaching this stage. In this stage, we will learn all about the environmental traits of living organisms.\n\nClick the button to start playing this stage.",
    "stage2_environmental_title": "What are Environmental Traits?",
    "stage2_environmental_desc": "Living creatures need to adapt to their environment for their survival. They can develop these environmental traits to do it.\n\nEnvironmental traits are the traits of a human, animal or plant that are influenced by the environment where they live. Some factors that can affect an organism's traits are food, temperature, diet, etc.",
    "stage2_solve_puzzle_title": "Solve The Puzzle!",
    "stage2_solve_puzzle_desc": "In this stage, you will learn all about the environmental traits of a camel. To do it, you must solve the puzzle that consists of different parts of the camel. Each time you placed the right part to the correct place, a dialog about the environmental traits of that body part will be shown.\n\nSo, what are you waiting for? Tap the button to play...",
    "stage2_finished_title": "Stage Finished",
    "stage2_finished_desc": "Well done. You have finished this stage. Now you know more about environmental traits than before. One last thing thing to know, even though the environmental traits are first developed for the organism to adapt to its environment, along the way they will be inherited to its offsprings. This will ensure the survivability of its own kinds.\n\nTap the button to start the next stage...",
    "stage2_timeup_title": "Time is up!",
    "stage2_timeup_desc": "Aw... Unfortunately the time is up. You haven't finished the game in time. Now, let us just go through all the traits that you have missed. And then we will move on to the next stage.",
    "stage2_timeup_finished_title": "Stage Finished",
    "stage2_timeup_finished_desc": "Now you know more about environmental traits than before. One last thing thing to know, even though the environmental traits are first developed so that the organism can adapt to its environment, along the way they will be inherited to its offsprings. This will ensure the survivability of their own kinds.\n\nTap the button to start the next stage...",
    "stage2_head_title": "Camel's Eyelashes, Eyebrows, and Nostrils",
    "stage2_head_desc": "Camels have long eyelashes that can keep sand out of their eyes. Furthermore, their eyebrows are thick and can shield their eyes from the desert sun. They also close the nostrils so that sand cannot enter their nose.",
    "stage2_drink_title": "Camel's Diet and Drinking Habits",
    "stage2_drink_desc": "Camels have a large, thick, and leathery mouth that can handle the prickly thorns of almost any vegetation in the desert, such as a cactus. They also drink a lot of water at once (up to 20 gallons). They can live without water for several weeks, and they can last several months without food.",
    "stage2_humps_title": "Camel's Humps",
    "stage2_humps_desc": "One of the most unique things about camels are their humps. Camels store fat in their humps. The fat can be used as a source of food and energy when they can't find any food in the desert. The fat from the humps can supply energy to the camels even when they don't eat for weeks, or even months.",
    "stage2_fur_title": "Camel's Fur and Metabolism",
    "stage2_fur_desc": "Camels have thick fur and underwool. This protects them from heatstrokes from the desert sun, while also keeping them warm at night. The camels's metabolism aalso lowers at night so they don't sweat as much. This in turn will preserve the amount of water in their body.",
    "stage2_legs_title": "Camel's Legs and Feet",
    "stage2_legs_desc": "Camels have long legs to help carry heavy loads over long distances and keep their body further away from the hot sand. They also have thick leathery patches on their knee to prevent getting burn when they kneel on the hot desert sand. Furthermore, camels feet are wide so they can walk on sand more easily. Their huge feet help them to walk on sand without sinking into it. ",
    "stage3_title": "Learned Traits",
    "stage3_welcome_title": "Stage 3: Learned Traits",
    "stage3_welcome_desc": "Wow, you're still here? That's awesome. I hope you're having fun so far. You have reached the last stage of this game. In this stage, you will learn all about the last type of traits, the learned trait.\n\nTap the button to start playing...",
    "stage3_learned_title": "What are Learned Traits?",
    "stage3_learned_desc": "Learned traits are traits that are acquired from experience and training, either by the organism itself or other outside factor, like human for example.\n\nSome examples of learned traits are a monkey trained to ride a bike, an otter using a rock to open up the shell of a clam, and circus animals trained to perform for the crowd.",
    "stage3_train_title": "It's Training Time!",
    "stage3_train_desc": "Speaking of circus animals, the camel that you have right now is one of them. And it is still untrained. So now your job is to train it to do two things, run when we command it to, and jump when we command it to. To train it, you must tap the \"Train\" button repeatedly. But remember to do it before the time runs out.\n\nTap the button to begin training it to run on command...",
    "stage3_timeup_run_title": "Time is up!",
    "stage3_timeup_run_desc": "Unfortunately the time is up. You haven't finished to fully train the camel in time. And because it is not fully trained, everytime you command it to run, there will be some chances that the camel will ignore it. \n\nIt is unfortunate, but we must go on with the training. Tap the button to train the camel to jump on command.",
    "stage3_welldone_run_title": "Training Completed!",
    "stage3_welldone_run_desc": "Awesome. You have successfully finished training your camel. Now it will run every time you command it to. But this is just half of the work. You still need to train it so that it will jump on our command.\n\nTap the button to begin training it to jump on command...",
    "stage3_timeup_jump_title": "Time is up!",
    "stage3_timeup_jump_desc": "Unfortunately the time is up. You haven't finished to fully train the camel in time. And because it is not fully trained, everytime you command it to jump, there will be some chances that the camel will ignore it.\n\nTap the button to continue...",
    "stage3_welldone_jump_title": "Training Completed!",
    "stage3_welldone_jump_desc": "Awesome. You have successfully finished training your camel. Now it will jump every time you command it to.\n\nNow the camel is ready. And we can continue with the show.\n\nTap the button to continue...",
    "stage3_finished_title": "Congratulations!",
    "stage3_finished_desc": "Well done. You have finished all the stages. And hopefully, you have learned more about inherited traits, environmental traits, and learned traits.\n\nThis is the end of the game. Please tap the button to end the game rightly!"
  }
}
